
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>GNU Özgür Belgelendirme Lisansı · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="Lisans metninin Türkçesidir. Aslında çeviridir. Lisansın İngilizce versiyonunun açıklaması niteliğindedir. Lisansın doğru anlaşılması için asıl metni okunması önemle rica olunur.">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="kaynakca.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Giriş
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">Başlangıç</li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="../baslangic/zfsnin-oezellikleri.html">
            
                <a href="../baslangic/zfsnin-oezellikleri.html">
            
                    
                    ZFS'nin Özellikleri
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2" data-path="../baslangic/zfsyi-anlamak.html">
            
                <a href="../baslangic/zfsyi-anlamak.html">
            
                    
                    ZFS'yi Anlamak
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.3" data-path="../baslangic/zfsyi-gercek-ortamda-kullanmak.html">
            
                <a href="../baslangic/zfsyi-gercek-ortamda-kullanmak.html">
            
                    
                    ZFS'yi Çalışma Ortamına Kurmak
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">ZFS'ye Giriş</li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="../zfsye-giris/zfs-ye-giris.html">
            
                <a href="../zfsye-giris/zfs-ye-giris.html">
            
                    
                    ZFS'ye Giriş
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">ZFS Havuzu</li>
        
        
    
        <li class="chapter " data-level="4.1" data-path="../zfs-havuzu/zfs-havuz-yoenetimi-basit-havuz-operasyonlari.html">
            
                <a href="../zfs-havuzu/zfs-havuz-yoenetimi-basit-havuz-operasyonlari.html">
            
                    
                    ZFS Havuz Yönetimi - Basit Havuz Operasyonları
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.2" data-path="../zfs-havuzu/zfs-havuz-yoenetimi-detayli-havuz-yoenetimi.html">
            
                <a href="../zfs-havuzu/zfs-havuz-yoenetimi-detayli-havuz-yoenetimi.html">
            
                    
                    ZFS Havuz Yönetimi - Detaylı Havuz Yönetimi
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">ZFS Dosya Hiyerarşisi</li>
        
        
    
        <li class="chapter " data-level="5.1" data-path="../zfs-dosya-hiyerarsisi/zfs-hiyerarshisi.html">
            
                <a href="../zfs-dosya-hiyerarsisi/zfs-hiyerarshisi.html">
            
                    
                    ZFS Disk Hiyerarşisi
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.2" data-path="../zfs-dosya-hiyerarsisi/zfs-uest-duezey-disk-hiyerarsi-komutlari.html">
            
                <a href="../zfs-dosya-hiyerarsisi/zfs-uest-duezey-disk-hiyerarsi-komutlari.html">
            
                    
                    ZFS Üst Düzey Disk Hiyerarşi Komutları
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">ZFS'de Ek Özellikler</li>
        
        
    
        <li class="chapter " data-level="6.1" data-path="../zfsde-ek-oezellikler/zfs-havuz-yoenetimi-bazi-ek-oezellikler.html">
            
                <a href="../zfsde-ek-oezellikler/zfs-havuz-yoenetimi-bazi-ek-oezellikler.html">
            
                    
                    ZFS Havuz Yönetimi - Bazı Ek Havuz Yönetimi Komutları
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">Gerçek Hayatta ZFS'nin Kullanımı</li>
        
        
    
        <li class="chapter " data-level="7.1" data-path="../gercek-hayatta-zfsnin-kullanimi/zfs-veri-kurtarma-senaryolari.html">
            
                <a href="../gercek-hayatta-zfsnin-kullanimi/zfs-veri-kurtarma-senaryolari.html">
            
                    
                    ZFS Veri Kurtarma Senaryoları
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">SON KISIM</li>
        
        
    
        <li class="chapter " data-level="8.1" data-path="ekler/">
            
                <a href="ekler/">
            
                    
                    Ekler
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="8.1.1" data-path="ekler/sikca-sorulan-sorular.html">
            
                <a href="ekler/sikca-sorulan-sorular.html">
            
                    
                    Sıkça Sorulan Sorular
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="8.1.2" data-path="ekler/kopya-kagidi.html">
            
                <a href="ekler/kopya-kagidi.html">
            
                    
                    ZFS Kopya Kağıdı
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="8.1.3" data-path="ekler/copy-on-write.html">
            
                <a href="ekler/copy-on-write.html">
            
                    
                    Copy-On-Write Nedir?
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="8.2" data-path="kaynakca.html">
            
                <a href="kaynakca.html">
            
                    
                    Kaynakça
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="8.3" data-path="lisans.html">
            
                <a href="lisans.html">
            
                    
                    GNU Özgür Belgelendirme Lisansı
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >GNU Özgür Belgelendirme Lisansı</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="gnu-&#xF6;zg&#xFC;r-belgelendirme-lisans&#x131;">GNU &#xD6;zg&#xFC;r Belgelendirme Lisans&#x131;</h1>
<p><strong>GNU &#xD6;zg&#xFC;r Belgelendirme Lisans&#x131;</strong></p>
<p>S&#xFC;r&#xFC;m 1.3, Kas&#x131;m 2008</p>
<p>Copyright (C) 2000, 2001, 2002, 2007, 2008 &#xD6;zg&#xFC;r Yaz&#x131;l&#x131;m Vakf&#x131; 51 Franklin St, Fifth Floor, Boston, MA 02110-1301 ABD <a href="https://fsf.org/" target="_blank">https://fsf.org/</a></p>
<p>Bu lisans belgesinin tam kopyas&#x131;n&#x131;n herkes taraf&#x131;ndan koplayalanmas&#x131; ve da&#x11F;&#x131;t&#x131;m&#x131; serbest olup, de&#x11F;i&#x15F;tirilmesi yasakt&#x131;r.</p>
<h3 id="0-gi&#x307;ri&#x307;&#x15F;">0. <strong>G&#x130;R&#x130;&#x15E;</strong></h3>
<p>&#x130;&#x15F;bu lisans&#x131;n amac&#x131; bir k&#x131;lavuzu, kaynak kitab&#x131; ya da di&#x11F;er i&#x15F;levsel ve faydal&#x131; belgeleri &#xF6;zg&#xFC;r k&#x131;lmak; yani herkesin bu belgeleri de&#x11F;i&#x15F;tirerek ya da de&#x11F;&#x15F;tirmeden, ticari ya da gayri ticari ama&#xE7;larla kopyalama ya da yeniden da&#x11F;&#x131;tma &#xF6;zg&#xFC;rl&#xFC;&#x11F;&#xFC;n&#xFC; garanti alt&#x131;na almakt&#x131;r. &#x130;kinci olarak, i&#x15F;bu lisans yazar ve yay&#x131;mc&#x131;n&#x131;n &#xE7;al&#x131;&#x15F;malar&#x131;ndan dolay&#x131; takdir g&#xF6;r&#xFC;rken ba&#x15F;kas&#x131; taraf&#x131;ndan yap&#x131;lan de&#x11F;i&#x15F;ikliklerden sorumlu tutulmamalar&#x131;n&#x131; sa&#x11F;lamay&#x131; hedefler.</p>
<p>&#x130;&#x15F;bu lisans telif m&#xFC;sadeli olup, bu belgeden t&#xFC;retilen &#xE7;al&#x131;&#x15F;malar&#x131;n da ayn&#x131; &#x15F;eklide &#xF6;zg&#xFC;r olmas&#x131; anlam&#x131;na gelir. &#xD6;zg&#xFC;r yaz&#x131;l&#x131;m i&#xE7;in tasarlanm&#x131;&#x15F; telif m&#xFC;sadeli GNU Genel Kamu Lisans&#x131;&#x2019;n&#x131; tamamlar niteliktedir.</p>
<p>&#x130;&#x15F;bu lisans&#x131; &#xF6;zg&#xFC;r yaz&#x131;l&#x131;m &#xFC;r&#xFC;nleri i&#xE7;in haz&#x131;rlanan k&#x131;lavuzlarda kullanmak i&#xE7;in tasarlad&#x131;k; &#xE7;&#xFC;nk&#xFC; &#xF6;zg&#xFC;r yaz&#x131;l&#x131;m &#xF6;zg&#xFC;r belgelendirmeye gerek duyar: bir &#xF6;zg&#xFC;r program, yaz&#x131;l&#x131;m&#x131;n sahip oldu&#x11F;u &#xF6;zg&#xFC;rl&#xFC;kleri i&#xE7;eren k&#x131;lavuzlar&#x131; beraberinde getirmelidir. Ancak i&#x15F;bu lisans, yaz&#x131;l&#x131;m k&#x131;lavuzlar&#x131;yla s&#x131;n&#x131;rl&#x131; de&#x11F;ildir; konusuna ya da bas&#x131;l&#x131; olup olmad&#x131;&#x11F;&#x131;na bak&#x131;lmaks&#x131;z&#x131;n her t&#xFC;rl&#xFC; metinsel &#xE7;al&#x131;&#x15F;ma i&#xE7;in kullan&#x131;labilir. &#x130;&#x15F;bu lisans&#x131;n &#xF6;zellikle a&#xE7;&#x131;klama ya da kaynak amac&#x131;yla haz&#x131;rlanan &#xE7;al&#x131;&#x15F;malar i&#xE7;in kullan&#x131;lmas&#x131; &#xF6;nerilir.</p>
<h3 id="1-uygulanabi&#x307;li&#x307;rli&#x307;k-ve-tanimlamalar">1. <strong>UYGULANAB&#x130;L&#x130;RL&#x130;K VE TANIMLAMALAR</strong></h3>
<p>&#x130;&#x15F;bu lisans; telif hakk&#x131; sahibi taraf&#x131;ndan bu lisans&#x131;n h&#xFC;k&#xFC;mleri uyar&#x131;nca da&#x11F;&#x131;t&#x131;labilece&#x11F;i belirtilen bir uyar&#x131; i&#xE7;eren k&#x131;lavuz ya da di&#x11F;er &#xE7;al&#x131;&#x15F;malara her ortamda uygulan&#x131;r. B&#xF6;yle bir uyar&#x131;, bahsi ge&#xE7;en &#xE7;al&#x131;&#x15F;may&#x131; burada bahsedilen &#x15F;artlar alt&#x131;nda kullanmak &#xFC;zere s&#x131;n&#x131;rs&#x131;z s&#xFC;reli, d&#xFC;nya &#xE7;ap&#x131;nda, telifsiz bir lisans verir. A&#x15F;a&#x11F;&#x131;da belirtilen &#x201C;Belge&#x201D; kavram&#x131; bu k&#x131;lavuz ya da &#xE7;al&#x131;&#x15F;malar&#x131; kasteder. Kamuoyundaki herkes lisans sahibidir ve bu lisans sahiplerine i&#x15F;bu belgede &#x201C;siz&#x201D; olarak hitap edilecektir. &#xC7;al&#x131;&#x15F;may&#x131; telif hakk&#x131; yasas&#x131; uyar&#x131;nca gereken izinler gerektirecek &#x15F;ekilde kopyalaman&#x131;z, de&#x11F;i&#x15F;tirmeniz ya da da&#x11F;&#x131;tman&#x131;z halinde lisans&#x131; kabul etmi&#x15F; say&#x131;l&#x131;rs&#x131;n&#x131;z.</p>
<p>Belgenin &#x201C;De&#x11F;i&#x15F;tirilmi&#x15F; S&#xFC;r&#xFC;m&#xFC;&#x201D;; ya tam kopyas&#x131;n&#x131; ya da yap&#x131;lan de&#x11F;i&#x15F;ikliklerle ve/veya ba&#x15F;ka bir dile yap&#x131;lan &#xE7;evirisiye birlikte, belgeyi ya da bir par&#xE7;as&#x131;n&#x131; i&#xE7;eren &#xE7;al&#x131;&#x15F;mad&#x131;r.</p>
<p>&#x201C;&#x130;kincil K&#x131;s&#x131;m&#x201D;; &#xF6;zellikle belgenin yazar&#x131;n&#x131;n ya da yay&#x131;nc&#x131;n&#x131;n belge konusuyla (ya da ilgili konularla) ili&#x15F;kisinden bahseden ya da belgenin konusuyla do&#x11F;rudan ilgili olmayan bir i&#xE7;eri&#x11F;e sahip, belgenin eki ya da &#xF6;n b&#xF6;l&#xFC;mleri ad&#x131; verilen k&#x131;s&#x131;mlar&#x131; kasteder. (Dolay&#x131;s&#x131;yla, e&#x11F;er belge bir matematik kitab&#x131;n&#x131;n bir par&#xE7;as&#x131;ysa, &#x130;kincil K&#x131;s&#x131;m matematikle ilgili bir a&#xE7;&#x131;klama i&#xE7;ermeyebilir.) Bahsedilen ili&#x15F;ki, konuyla ya da benzer hususlarla ilgili tarihsel bir mesele, ya da yasal, ticari, felsefi, etnik ya da politik duru&#x15F;a dair bir mesele olabilir.</p>
<p>&#x201C; De&#x11F;i&#x15F;meyen K&#x131;s&#x131;mlar&#x201D;; belgenin i&#x15F;bu lisans alt&#x131;nda &#xE7;&#x131;kar&#x131;ld&#x131;&#x11F;&#x131;n&#x131; belirten uyar&#x131;da de&#x11F;i&#x15F;meyen k&#x131;s&#x131;mlar olarak ba&#x15F;l&#x131;klar&#x131; tayin edilen baz&#x131; ikincil k&#x131;s&#x131;mlar&#x131; kasteder. E&#x11F;er bir k&#x131;s&#x131;m, yukar&#x131;daki ikincil k&#x131;s&#x131;m tan&#x131;m&#x131;na uymuyorsa, De&#x11F;i&#x15F;meyen K&#x131;s&#x131;m olarak adland&#x131;r&#x131;lmas&#x131;na izin verilmez. Belge hi&#xE7; De&#x11F;i&#x15F;meyen K&#x131;s&#x131;m i&#xE7;ermeyebilir. E&#x11F;er belge herhangi bir De&#x11F;i&#x15F;meyen K&#x131;s&#x131;m belirlemediyse, o belgede De&#x11F;i&#x15F;meyen K&#x131;s&#x131;m yok demektir.</p>
<p>&#x201C;Kapak Metinleri&#x201D;, belgenin i&#x15F;bu lisans alt&#x131;nda &#xE7;&#x131;kar&#x131;ld&#x131;&#x11F;&#x131;n&#x131; belirten uyar&#x131;da &#xD6;n Kapak Yaz&#x131;lar&#x131; ya da Arka Kapak Yaz&#x131;lar&#x131; olarak s&#x131;ralanan, metnin baz&#x131; k&#x131;sa paragraflar&#x131;d&#x131;r. Bir &#xD6;n Kapak Yaz&#x131;s&#x131; en fazla 5, bir Arka Kapak Yaz&#x131;s&#x131; en fazla 25 kelime i&#xE7;erebilir.</p>
<p>Metnin &#x201C;Transparan&#x201D; kopyalar&#x131;; makine taraf&#x131;ndan okunabilir, a&#xE7;&#x131;klamalar&#x131; genel kamuya a&#xE7;&#x131;k, genel metin d&#xFC;zenleyiciler ya da (piksellerle olu&#x15F;turulmu&#x15F; resimler i&#xE7;in) genel boyama programlar&#x131; ya da ( &#xE7;izimler i&#xE7;in) yayg&#x131;n &#xE7;izim d&#xFC;zenleyiciler taraf&#x131;ndan belgeyi a&#xE7;&#x131;k&#xE7;a d&#xFC;zenlemeye elveri&#x15F;li bi&#xE7;imde olan; metin formatlay&#x131;c&#x131;lar i&#xE7;in girdi olarak ya da otomatik &#xE7;eviri bak&#x131;m&#x131;ndan metin formatlay&#x131;c&#x131;lar i&#xE7;in &#xE7;e&#x15F;itli bi&#xE7;imlerde girdiler olarak uygun kopyad&#x131;r. Bi&#xE7;imlendirmesi okuycular taraf&#x131;ndan daha sonra yap&#x131;lacak de&#x11F;i&#x15F;iklikleri bozmak ya da engellemek i&#xE7;in tasarlanm&#x131;&#x15F; ba&#x15F;ka &#x201C;Transparan&#x201D; bi&#xE7;imlerde yap&#x131;ld&#x131;ysa, ya da bi&#xE7;imlendirme yoksa, bunlar &#x201C;Transparan&#x201D; say&#x131;lmaz. Bir g&#xF6;r&#xFC;nt&#xFC; format&#x131; e&#x11F;er az&#x131;msanmayacak miktardaki bir metin i&#xE7;in kullan&#x131;ld&#x131;ysa Transparan say&#x131;lmaz. &#x201C;Transparan&#x201D; olmayan kopyalara &#x201C;Opak&#x201D; denir.</p>
<p>Transparan kopyalar i&#xE7;in uygun &#xF6;rnekler aras&#x131;nda d&#xFC;z, bi&#xE7;imlendirmesiz ASCII, Textinfo veri format&#x131;, LaTeX veri format&#x131;, kamuya a&#xE7;&#x131;k DTD kullanan SGML veya XML, insan eliyle d&#xFC;zeltmeye elveri&#x15F;li tasarlanm&#x131;&#x15F; standatlara uygun temel HTML, Postscript ya da insan eliyle d&#xFC;zeltmek i&#xE7;in tasarlanm&#x131;&#x15F; PDF say&#x131;labilir. Transparan g&#xF6;rsel formatlar&#x131; aras&#x131;nda PNG, XCF ve JPG vard&#x131;r. Opak bi&#xE7;imlere &#xF6;rnekler aras&#x131;nda sadece patentli kelime i&#x15F;lemciler taraf&#x131;ndan okunup d&#xFC;zenlenebilen patentli bi&#xE7;imler, BTT&#x2019;nin ve/veya i&#x15F;leme ara&#xE7;lar&#x131;n&#x131;n genelde uygun bulunmad&#x131;&#x11F;&#x131; SGML ya da XML, ve sadece &#xE7;&#x131;kt&#x131; ama&#xE7;l&#x131; baz&#x131; kelime i&#x15F;lemciler taraf&#x131;ndan &#xFC;retilen makine taraf&#x131;ndan olu&#x15F;turulmu&#x15F; HTML, PostScript veya PDF bulunur.</p>
<p>&#x201C;Ba&#x15F; Sayfa&#x201D;, bas&#x131;l&#x131; bir kitap i&#xE7;in ba&#x15F;taki sayfa ve i&#x15F;bu lisans&#x131;n ba&#x15F; sayfada g&#xF6;r&#xFC;nmesini zorunlu k&#x131;ld&#x131;&#x11F;&#x131; materyali okunakl&#x131; bir &#x15F;ekilde i&#xE7;ermesi i&#xE7;in gereken sonraki sayfalard&#x131;r.Bir ba&#x15F; sayfas&#x131; olmayan bi&#xE7;imlerdeki &#xE7;al&#x131;&#x15F;malar i&#xE7;in &#x201C;Ba&#x15F; Sayfa&#x201D;, metin g&#xF6;vdesinden &#xF6;nce &#xE7;al&#x131;&#x15F;man&#x131;n ba&#x15F;l&#x131;&#x11F;&#x131;n&#x131;n yan&#x131;nda en g&#xF6;ze &#xE7;arpan metindir.</p>
<p>&#x201C;Yay&#x131;mc&#x131;&#x201D; belgenin kopyalar&#x131;n&#x131; kamuya da&#x11F;&#x131;tan her t&#xFC;rl&#xFC; ki&#x15F;i ya da kurulu&#x15F; anlam&#x131;na gelir.</p>
<p>&#x201C;XYZ Ba&#x15F;l&#x131;kl&#x131;&#x201D; &#x15F;eklindeki bir k&#x131;s&#x131;m, ba&#x15F;l&#x131;&#x11F;&#x131; a&#xE7;&#x131;k&#xE7;a XYZ olan ya da XYZ&#x2019;nin ba&#x15F;ka dildeki &#xE7;evirisini parantezle bir sonraki c&#xFC;mlede i&#xE7;eren bir ba&#x15F;l&#x131;&#x11F;a sahip belgenin altbirimi oldu&#x11F;u anlam&#x131;na gelir. (Burada XYZ a&#x15F;a&#x11F;&#x131;da bahsi ge&#xE7;en &#xF6;zel bir k&#x131;s&#x131;m ad&#x131; anlam&#x131;ndad&#x131;r; &#xF6;rne&#x11F;in &#x201C;Referanslar&#x201D;, &#x201C;&#x130;thaflar&#x201D;, &#x201C;Onaylar&#x201D; ya da &#x201C;Ge&#xE7;mi&#x15F;&#x201D; gibi.) Belgeyi d&#xFC;zenlerken b&#xF6;yle bir k&#x131;sm&#x131;n &#x201C;Ba&#x15F;l&#x131;&#x11F;&#x131;n&#x131; Korumak&#x201D; demek, bu tan&#x131;mlamaya g&#xF6;re &#x201C;XYZ Ba&#x15F;l&#x131;kl&#x131;&#x201D; ad&#x131;nda bir k&#x131;sm&#x131; koruyor demektir.</p>
<p>Belge, i&#x15F;bu lisans&#x131;n belgeye uyguland&#x131;&#x11F;&#x131;n&#x131; belirten uyar&#x131;n&#x131;n yan&#x131;nda Haklar&#x131;ndan Vazge&#xE7;enler&#x2019;i de i&#xE7;erebilir. Bahsi ge&#xE7;en Haklar&#x131;ndan Vazge&#xE7;enler, i&#x15F;bu lisansta referans olarak dahil edilmi&#x15F; kabul edilir, ancak bu durum sadece haklardan vazge&#xE7;me konusunda b&#xF6;yle say&#x131;l&#x131;r: Bahsi ge&#xE7;en Haklar&#x131;ndan Vazge&#xE7;enler&#x2019;in her t&#xFC;rl&#xFC; &#xE7;&#x131;kar&#x131;m&#x131; h&#xFC;k&#xFC;ms&#xFC;z olup, i&#x15F;bu lisans&#x131;n anlam&#x131;na etki etmemektedir.</p>
<h3 id="2-bi&#x307;rebi&#x307;r-kopyalamak">2. <strong>B&#x130;REB&#x130;R KOPYALAMAK</strong></h3>
<p>&#x130;&#x15F;bu lisans&#x131;n, telif hakk&#x131; uyar&#x131;lar&#x131; ve lisans&#x131;n belgeye uyguland&#x131;&#x11F;&#x131;n&#x131; belirten lisans uyar&#x131;lar&#x131;n&#x131;n sonraki kopyalarda yer almas&#x131; &#x15F;art&#x131;yla; ve ayr&#x131;ca i&#x15F;bu lisans&#x131;n ko&#x15F;ullar&#x131; &#xFC;zerine ba&#x15F;ka ko&#x15F;ullar eklememeniz ko&#x15F;uluyla; belgeyi her ortamda ticari ya da gayriticari olarak birebir kopyalayabilir ve da&#x11F;&#x131;tabilirsiniz. Kopyalad&#x131;&#x11F;&#x131;n&#x131;z ya da da&#x11F;&#x131;t&#x131;m&#x131;n&#x131; yapt&#x131;&#x11F;&#x131;n&#x131;z belgelerin okunmas&#x131;n&#x131; ya da daha sonra kopyalanmas&#x131;n&#x131; engelleyecek ya da denetleyecek teknik &#xF6;nlemlere ba&#x15F;vuramazs&#x131;n&#x131;z. Ancak, kopyalar&#x131;n kar&#x15F;&#x131;l&#x131;&#x11F;&#x131;nda &#xFC;cret kabul edebilirsiniz. Yeterince &#xE7;ok say&#x131;da kopya da&#x11F;&#x131;t&#x131;rsan&#x131;z, B&#xF6;l&#xFC;m 3&#x2032;te yer alan ko&#x15F;ullara uyman&#x131;z gerekir.</p>
<p><strong>Bunun yan&#x131;nda yukar&#x131;da belirtilen ko&#x15F;ullar dahilinde kopyalar&#x131; &#xF6;d&#xFC;n&#xE7; verebilir, kamuya a&#xE7;&#x131;k olarak g&#xF6;sterebilirsiniz.</strong></p>
<h3 id="3-adetle-kopyalamak">3. <strong>ADETLE KOPYALAMAK</strong></h3>
<p><strong>E&#x11F;er belgenin bas&#x131;l&#x131; kopyalar&#x131;n&#x131; (ya da kapaklar&#x131; basan bas&#x131;ndaki kopyalar&#x131;) 100 adetten fazla yay&#x131;mlarsan&#x131;z ve belgenin lisans uyar&#x131;s&#x131; Kapak Metinleri gerektiriyorsa, t&#xFC;m bu kapak metinlerini a&#xE7;&#x131;k&#xE7;a ve okunakl&#x131; olarak ta&#x15F;&#x131;yan kapaklar&#x131; kopyalara ili&#x15F;tirmeniz gerekir; &#xF6;n kapakta &#xF6;n kapak metinleri, arka kapakta arka kapak metinleri olacak &#x15F;ekilde d&#xFC;zenlenmelidir. Her iki kapak da sizin yay&#x131;c&#x131; oldu&#x11F;unuza dair a&#xE7;&#x131;k ve okunakl&#x131; bir ibare i&#xE7;ermelidir. &#xD6;n kapak ba&#x15F;l&#x131;&#x11F;&#x131;n t&#xFC;m kelimelerini ayn&#x131; &#xF6;l&#xE7;&#xFC;de g&#xF6;ze &#xE7;arpan ve g&#xF6;r&#xFC;nen &#x15F;ekilde i&#xE7;ermelidir. Kapaklara ilaveten di&#x11F;er materyalleri de ekleyebilirsiniz. Kopyalarda de&#x11F;i&#x15F;iklik yapmak kapaklarla s&#x131;n&#x131;rl&#x131; olup, belge ba&#x15F;l&#x131;&#x11F;&#x131;n&#x131;n tamam&#x131;n&#x131; i&#xE7;erdikleri ve &#x15F;artlar&#x131; yerine getirdikleri s&#xFC;rece bu kopyalar di&#x11F;er a&#xE7;&#x131;lardan birebir kopya say&#x131;l&#x131;rlar.</strong></p>
<p><strong>E&#x11F;er herbir kapak i&#xE7;in gerek g&#xF6;r&#xFC;len metinler okunakl&#x131; bir &#x15F;ekilde yerle&#x15F;tirmek i&#xE7;in fazlaysa, ilk ba&#x15F;takileri mevcut kapa&#x11F;a (kabul edilebilir &#xF6;l&#xE7;&#xFC;de s&#x131;&#x11F;acak &#x15F;ekilde) ili&#x15F;tirdikten sonra geri kalan&#x131; devam&#x131;ndaki yak&#x131;n sayfalara yerle&#x15F;tirmelisiniz.</strong></p>
<p><strong>E&#x11F;er belgenin opak kopyalar&#x131;n&#x131; 100 adetten fazla yay&#x131;mlarsan&#x131;z ya da da&#x11F;&#x131;t&#x131;rsan&#x131;z, herbir opak kopyayla birlikte makine taraf&#x131;ndan okunabilir bir transparan kopya ili&#x15F;tirmeli ya da fazladan eklenmi&#x15F; bir materyal i&#xE7;ermeyen, genel a&#x11F; kullan&#x131;c&#x131;s&#x131;n&#x131;n kamu standart&#x131; a&#x11F; protokolleri kullanarak indirmeye yetkisinin oldu&#x11F;u bir transparan kopyan&#x131;n bulundu&#x11F;u bir bilgisayar a&#x11F;&#x131; konumunu opak kopyada belirtmelisiniz. E&#x11F;er ikinci ko&#x15F;ulu uygulad&#x131;ysan&#x131;z; opak kopyalar&#x131; &#xE7;ok adette da&#x11F;&#x131;tmaya ba&#x15F;larken transparan kopyan&#x131;n belirtilen konumda en az&#x131;ndan opak kopyay&#x131; (do&#x11F;rudan ya da arac&#x131;lar&#x131;n&#x131;z veya bayiler yoluyla) da&#x11F;&#x131;tman&#x131;zdan bir y&#x131;l sonra da ula&#x15F;&#x131;labilirli&#x11F;inden emin olmak ad&#x131;na dikkatli ad&#x131;mlar atmal&#x131;s&#x131;n&#x131;z.</strong></p>
<p><strong>Fazla adette yeniden da&#x11F;&#x131;t&#x131;m yapmadan &#xF6;nce belgenin g&#xFC;ncel halini size sa&#x11F;layabilme f&#x131;rsat&#x131; vermek ad&#x131;na belgenin yazarlar&#x131;yla ileti&#x15F;ime ge&#xE7;meniz zorunlu olmamakla birlikte &#xF6;nerilir.</strong></p>
<h3 id="4-de&#x11F;i&#x307;&#x15F;i&#x307;kli&#x307;kler">4. <strong>DE&#x11E;&#x130;&#x15E;&#x130;KL&#x130;KLER</strong></h3>
<p>Kesinlikle i&#x15F;bu lisans alt&#x131;nda yay&#x131;mlamak ko&#x15F;uluyla, belgenin yerini doldurabilecek de&#x11F;i&#x15F;tirilmi&#x15F; s&#xFC;r&#xFC;mleri, da&#x11F;&#x131;t&#x131;m&#x131; ve de&#x11F;i&#x15F;tirilmesi i&#xE7;in gereken lisans&#x131; kopyaya sahip olacaklara vererek yukar&#x131;da b&#xF6;l&#xFC;m 2 ve 3&#x2032;teki ko&#x15F;ullar alt&#x131;nda kopyalayabilir ya da da&#x11F;&#x131;tabilirsiniz. Buna ek olarak, a&#x15F;a&#x11F;&#x131;daki ko&#x15F;ullar de&#x11F;i&#x15F;tirilmi&#x15F; s&#xFC;r&#xFC;m i&#xE7;in yerine getirmek zorundas&#x131;n&#x131;z:</p>
<ul>
<li>A. Ba&#x15F; sayfada (ya da varsa kapaklarda) belgeden ve &#xF6;nceki di&#x11F;er s&#xFC;r&#xFC;mlerden (e&#x11F;er mevcutlarsa belgenin Ge&#xE7;mi&#x15F; k&#x131;sm&#x131;nda listelenmelidirler) farkl&#x131; bir ba&#x15F;l&#x131;k kullanmal&#x131;s&#x131;n&#x131;z. E&#x11F;er &#xF6;zg&#xFC;n metnin yay&#x131;mc&#x131;s&#x131; size bu hakk&#x131; tan&#x131;yorsa &#xF6;nceki s&#xFC;r&#xFC;mlerin ba&#x15F;l&#x131;&#x11F;&#x131;n&#x131; aynen muhafaza edebilirsiniz.</li>
<li>B. Bu gereklilikten muaf tutulmad&#x131;&#x11F;&#x131;n&#x131;z s&#xFC;rece, ba&#x15F; sayfada, de&#x11F;i&#x15F;tirilmi&#x15F; s&#xFC;r&#xFC;mdeki de&#x11F;i&#x15F;ikliklerin yaz&#x131;lmas&#x131;ndan sorumlu bir ya da daha fazla ki&#x15F;i veya kurulu&#x15F;un ad&#x131;n&#x131;, belgenin esas yazarlar&#x131;ndan en az be&#x15F;inin (be&#x15F;ten az ki&#x15F;iyse hepsinin) de isminin yer alaca&#x11F;&#x131; &#x15F;ekilde yazarlar olarak listeleyiniz.</li>
<li>C. De&#x11F;i&#x15F;tirilmi&#x15F; s&#xFC;r&#xFC;m&#xFC;n yay&#x131;mc&#x131;s&#x131;n&#x131;n ad&#x131;n&#x131; yay&#x131;mc&#x131; olarak ba&#x15F; sayfada belirtiniz.</li>
<li>D. Belgenin t&#xFC;m lisans uyar&#x131;lar&#x131;n&#x131; muhafaza ediniz.</li>
<li>E. Di&#x11F;er lisans uyar&#x131;lar&#x131;n&#x131; takip eden sayfalara yapt&#x131;&#x11F;&#x131;n&#x131;z de&#x11F;i&#x15F;iklikler i&#xE7;in de uygun lisans uyar&#x131;lar&#x131; ekleyiniz.</li>
<li>F. Lisans uyar&#x131;lar&#x131;n&#x131;n hemen ard&#x131;ndan, i&#x15F;bu lisans gere&#x11F;ince kamuya De&#x11F;i&#x15F;tirilmi&#x15F; s&#xFC;r&#xFC;m&#xFC;n kullan&#x131;m hakk&#x131;n&#x131; verdi&#x11F;inize dair a&#x15F;a&#x11F;&#x131;daki ekte g&#xF6;sterildi&#x11F;i &#x15F;ekilde bir uyar&#x131; ekleyiniz.</li>
<li>G. De&#x11F;i&#x15F;tirilmi&#x15F; S&#xFC;r&#xFC;m&#xFC;n lisans uyar&#x131;s&#x131;nda, belgenin lisans uyar&#x131;s&#x131;nda sunulan De&#x11F;i&#x15F;meyen K&#x131;s&#x131;mlar&#x131;n tam listesini ve gerekli Kapak Metinlerini koruyunuz.</li>
<li>H. &#x130;&#x15F;bu Lisans&#x131;n de&#x11F;i&#x15F;trilmemi&#x15F; bir kopyas&#x131;n&#x131; ekleyiniz.</li>
<li>I. &#x201C;Ge&#xE7;mi&#x15F;&#x201D; olarak adland&#x131;r&#x131;lan k&#x131;sm&#x131; ve ba&#x15F;l&#x131;&#x11F;&#x131;n&#x131; muhafaza ediniz, ve bu k&#x131;sma en az&#x131;ndan De&#x11F;i&#x15F;tirilmi&#x15F; S&#xFC;r&#xFC;m&#xFC;n ba&#x15F;l&#x131;&#x11F;&#x131;n&#x131;, y&#x131;l&#x131;n&#x131;, yeni yazarlar&#x131; ve yay&#x131;mc&#x131;s&#x131;n&#x131; belirten bir maddeyi ba&#x15F; sayfada sunuldu&#x11F;u gibi ekleyiniz. E&#x11F;er belgede &#x201D;Ge&#xE7;mi&#x15F;&#x201D; ad&#x131;nda bir k&#x131;s&#x131;m yer alm&#x131;yorsa, ba&#x15F; sayfada yer ald&#x131;&#x11F;&#x131; gibi belgenin ba&#x15F;l&#x131;&#x11F;&#x131;, y&#x131;l&#x131;, yazarlar&#x131; ve yay&#x131;mc&#x131;s&#x131; bilgilerini i&#xE7;erecek &#x15F;ekilde b&#xF6;yle bir k&#x131;s&#x131;m olu&#x15F;turunuz, daha sonra &#xF6;nceki c&#xFC;mlede belirtildi&#x11F;i &#xFC;zere De&#x11F;i&#x15F;tirilmi&#x15F; S&#xFC;r&#xFC;m bilgisini ekleyiniz.</li>
<li>J. E&#x11F;er mevcutsa belgenin i&#xE7;inde transparan kopyas&#x131;na kamu taraf&#x131;ndan eri&#x15F;im sa&#x11F;lanan a&#x11F; konumunu muhafaza ediniz, ve ayn&#x131; &#x15F;ekilde belgenin dayand&#x131;&#x11F;&#x131; &#xF6;nceki s&#xFC;r&#xFC;mlere eri&#x15F;im sa&#x11F;layan a&#x11F; konumlar&#x131;n&#x131; da muhafaza ediniz. Bu bilgiler &#x201C;Ge&#xE7;mi&#x15F;&#x201D; k&#x131;sm&#x131;nda konumland&#x131;r&#x131;lm&#x131;&#x15F; olabilir. Belgenin kendisinden en az d&#xF6;rt y&#x131;l &#xF6;nce yay&#x131;mlanm&#x131;&#x15F; ya da s&#xFC;r&#xFC;m&#xFC;n yay&#x131;mc&#x131;s&#x131; taraf&#x131;ndan izin verilmi&#x15F; bir &#xE7;al&#x131;&#x15F;man&#x131;n a&#x11F; konumunu &#xE7;&#x131;karabilirsiniz.</li>
<li>K. &#x201C;Referanslar&#x201D; ya da &#x201C;&#x130;thaflar&#x201D; olarak adland&#x131;r&#x131;lan k&#x131;s&#x131;mda, ilgili k&#x131;sm&#x131;n ba&#x15F;l&#x131;&#x11F;&#x131;n&#x131; koruyunuz, ve bahsi ge&#xE7;en k&#x131;s&#x131;mda verilen her bir katk&#x131; sa&#x11F;layan referans&#x131;n ve/veya ithaf&#x131;n i&#xE7;eri&#x11F;ini ve niteli&#x11F;ini koruyunuz.</li>
<li>L. Belgenin t&#xFC;m De&#x11F;i&#x15F;meyen K&#x131;s&#x131;mlar&#x131;n&#x131; ba&#x15F;l&#x131;k ve metinleri de&#x11F;i&#x15F;mede muhafaza ediniz. B&#xF6;l&#xFC;m numaralar&#x131; veya e&#x15F;de&#x11F;erleri b&#xF6;l&#xFC;m ba&#x15F;l&#x131;&#x11F;&#x131;n&#x131;n birer par&#xE7;as&#x131; olarak kabul edilmezler.</li>
<li>M. &#x201C;Onaylar&#x201D; ad&#x131;nda bir k&#x131;s&#x131;m yer al&#x131;yorsa bu k&#x131;sm&#x131; siliniz. B&#xF6;yle bir k&#x131;s&#x131;m De&#x11F;i&#x15F;tirilmi&#x15F; S&#xFC;r&#xFC;mde yer almayabilir.</li>
<li>N. Var olan bir k&#x131;sm&#x131; &#x201C;Onaylar&#x201D; olarak yeniden adland&#x131;rmay&#x131;n&#x131;z, ya da herhangi bir De&#x11F;i&#x15F;meyen k&#x131;sm&#x131;n ismiyle &#xE7;ak&#x131;&#x15F;t&#x131;rmay&#x131;n&#x131;z.</li>
<li>O. Her t&#xFC;rl&#xFC; Haklar&#x131;ndan Vazge&#xE7;enler maddesini koruyunuz.</li>
</ul>
<p>E&#x11F;er De&#x11F;i&#x15F;tirilmi&#x15F; S&#xFC;r&#xFC;m &#x130;kincil K&#x131;s&#x131;mlar olarak nitelendirilen ve belgeden kopyalanm&#x131;&#x15F; herhangi bir materyal i&#xE7;ermeyen yeni &#xF6;n b&#xF6;l&#xFC;m k&#x131;s&#x131;mlar&#x131; ve ekler i&#xE7;eriyorsa, bu k&#x131;s&#x131;mlar&#x131;n bir k&#x131;sm&#x131;n&#x131; ya da t&#xFC;m&#xFC;n&#xFC; de&#x11F;i&#x15F;meyen olarak tan&#x131;mlama se&#xE7;ene&#x11F;iniz mevcuttur. Bunu yapmak i&#xE7;in, De&#x11F;i&#x15F;trilmi&#x15F; S&#xFC;r&#xFC;m&#xFC;n lisans uyar&#x131;s&#x131;n&#x131;n De&#x11F;i&#x15F;meyen K&#x131;s&#x131;mlar listesine ba&#x15F;l&#x131;klar&#x131;n&#x131; ekleyiniz. Bu ba&#x15F;l&#x131;klar di&#x11F;er herhangi b&#xF6;l&#xFC;m ba&#x15F;l&#x131;klar&#x131;ndan farkl&#x131; olmal&#x131;d&#x131;r.</p>
<p>De&#x11F;i&#x15F;tirimi&#x15F; S&#xFC;r&#xFC;m&#xFC;n&#xFC;z&#xFC;n &#xE7;e&#x15F;itli k&#x131;s&#x131;mlar&#x131;ndan Onaylar d&#x131;&#x15F;&#x131;nda bir &#x15F;ey i&#xE7;ermedi&#x11F;i takdirde, &#x201C;Onaylar&#x201D; ba&#x15F;l&#x131;kl&#x131; bir k&#x131;s&#x131;m ekleyebilirsiniz; &#xF6;rne&#x11F;in emsal de&#x11F;erlendirme ya da metnin bir kurulu&#x15F; taraf&#x131;ndan bir standard&#x131;n yetkili a&#xE7;&#x131;klamas&#x131; olarak kabul edilme a&#xE7;&#x131;klamalar&#x131;ysa yukar&#x131;daki durum uygulan&#x131;r.</p>
<p>&#xD6;n kapak metni olarak en fazla be&#x15F; kelimelik, arka ka&#x11F;ak metni olarak da en fazla 25 kelimelik birer metni De&#x11F;i&#x15F;tirilmi&#x15F; S&#xFC;r&#xFC;mdeki ba&#x15F;l&#x131;k metinleri listesinin sonuna ekleyebilirsiniz. &#xD6;n Kapak Metni ve arka kapak metni olarak sadece birer metin yap&#x131;lan s&#xF6;zle&#x15F;melere g&#xF6;re eklenebilir. E&#x11F;er metin ayn&#x131; kapak i&#xE7;in daha &#xF6;nce taraf&#x131;n&#x131;zdan ya da ad&#x131;na icraatte bulundu&#x11F;unuz kurulu&#x15F; taraf&#x131;ndan s&#xF6;zle&#x15F;me gere&#x11F;i eklenmi&#x15F; bir kapak metni i&#xE7;eriyorsa, bir ba&#x15F;kas&#x131;n&#x131; ekleyemezsiniz; ancak bir &#xF6;ncekini ekleyen yay&#x131;mc&#x131;n&#x131;n a&#xE7;&#x131;k&#xE7;a izin vermesi durumunda yenisiyle de&#x11F;i&#x15F;tirebilirsiniz.</p>
<p>Belgenin yazar(lar)&#x131; ve yay&#x131;mc&#x131;(lar)&#x131; i&#x15F;bu lisans uyar&#x131;nca herhangi bir De&#x11F;i&#x15F;tirilmi&#x15F; S&#xFC;r&#xFC;m &#xFC;zerinde onaylar&#x131;n&#x131; kan&#x131;tlamak ya da ifade etmek amac&#x131;yla isimlerinin reklam ama&#xE7;l&#x131; kullan&#x131;lmas&#x131;na izin vermezler.</p>
<h3 id="5--belgeleri&#x307;-bi&#x307;rle&#x15F;ti&#x307;rme">5.  <strong>BELGELER&#x130; B&#x130;RLE&#x15E;T&#x130;RME</strong></h3>
<p>De&#x11F;i&#x15F;tirilmi&#x15F; S&#xFC;r&#xFC;mler i&#xE7;in yukar&#x131;da b&#xF6;l&#xFC;m 4&#x2032;te belirlenen ko&#x15F;ullar uyar&#x131;nca, t&#xFC;m &#xF6;zg&#xFC;n belgelerin de&#x11F;i&#x15F;meyen k&#x131;s&#x131;mlar&#x131;n&#x131;n&#x131;n birle&#x15F;imini de&#x11F;i&#x15F;tirmeden eklemeniz ve lisans uyar&#x131;s&#x131;nda birle&#x15F;tirilmi&#x15F; &#xE7;al&#x131;&#x15F;man&#x131;z&#x131;n de&#x11F;i&#x15F;meyen k&#x131;s&#x131;mlar&#x131; olarak listelemeniz, ve Haklar&#x131;ndan Vazge&#xE7;enler&#x2019;i koruman&#x131;z ko&#x15F;uluyla, belgenizi bu lisansla piyasaya sunulmu&#x15F; di&#x11F;er belgelerle birle&#x15F;tirebilirsiniz.</p>
<p>Birle&#x15F;tirilmi&#x15F; &#xE7;al&#x131;&#x15F;man&#x131;n bu lisans&#x131;n sadece bir kopyas&#x131;n&#x131; i&#xE7;ermesi yeterlidir, birden &#xE7;ok e&#x15F;de&#x11F;er de&#x11F;i&#x15F;meyen k&#x131;s&#x131;m yerine sadece bir de&#x11F;i&#x15F;meyen k&#x131;s&#x131;m konulabilir. E&#x11F;er ayn&#x131; isimde fakat farkl&#x131; i&#xE7;erikte birden fazla de&#x11F;i&#x15F;meyen k&#x131;s&#x131;m varsa, bu &#x15F;ekildeki k&#x131;s&#x131;mlar&#x131;n herbirine, sonuna eklemek suretiyle parantez i&#xE7;inde kendine &#xF6;zg&#xFC; bir ba&#x15F;l&#x131;k, &#xF6;zg&#xFC;n yazar&#x131;n&#x131;n ismini ya da biliniyorsa o k&#x131;sm&#x131;n yay&#x131;mc&#x131;s&#x131;n&#x131;, veya kendine &#xF6;zg&#xFC; bir numara ekleyiniz. Ayn&#x131; d&#xFC;zenlemeyi birle&#x15F;tirilmi&#x15F; &#xE7;al&#x131;&#x15F;man&#x131;n lisans uyar&#x131;s&#x131;ndaki de&#x11F;i&#x15F;meyen k&#x131;s&#x131;mlar listesindeki k&#x131;s&#x131;m ba&#x15F;l&#x131;klar&#x131;nda da yap&#x131;n&#x131;z.</p>
<p>Birle&#x15F;tirilmi&#x15F; &#xE7;al&#x131;&#x15F;mada, &#xE7;e&#x15F;itli &#xF6;zg&#xFC;n metinlerde &#x201C;Ge&#xE7;mi&#x15F;&#x201D; olarak adland&#x131;r&#x131;lm&#x131;&#x15F; k&#x131;s&#x131;mlar&#x131; tek bir &#x201C;Ge&#xE7;mi&#x15F;&#x201D; ba&#x15F;l&#x131;kl&#x131; bir k&#x131;s&#x131;mda toplamal&#x131;s&#x131;n&#x131;z; &#x201C;Refeanslar&#x201D; adl&#x131; k&#x131;s&#x131;mlar&#x131; ve &#x201C;&#x130;thaflar&#x201D; adl&#x131; k&#x131;s&#x131;mlar&#x131; da ayn&#x131; &#x15F;ekilde birle&#x15F;tiriniz. &#x201C;Onaylar&#x201D; ad&#x131; verilen t&#xFC;m k&#x131;s&#x131;mlar&#x131; silmelisiniz.</p>
<h3 id="6-belgeleri&#x307;n-derlemesi&#x307;">6. BELGELER&#x130;N DERLEMES&#x130;</h3>
<p>&#x130;&#x15F;bu lisans&#x131;n di&#x11F;er her hususta herbir belge i&#xE7;in birebir kopyalama ko&#x15F;ullar&#x131;n&#x131; yerine getirdi&#x11F;iniz s&#xFC;rece, belgeyi bu lisans alt&#x131;nda piyasaya s&#xFC;r&#xFC;len di&#x11F;er belgelerle birlikte derleyebilir,ve i&#x15F;bu lisans&#x131;n &#xE7;e&#x15F;itli belgelerdeki ki&#x15F;isel kopyalar&#x131;n&#x131; derlemede yer alan bir kopyayla de&#x11F;i&#x15F;tirebilirsiniz.</p>
<p>&#x130;&#x15F;bu lisans&#x131;n bir kopyas&#x131;n&#x131; &#xE7;&#x131;kar&#x131;lm&#x131;&#x15F; belgeye ili&#x15F;tirmeniz ve belgenin birebir kopyalar&#x131;nda di&#x11F;er t&#xFC;m hususlarda i&#x15F;bu lisans&#x131; takip etmeniz ko&#x15F;uluyla; b&#xF6;yle bir derlemeden tek bir belgeyi &#xE7;&#x131;karabilir, i&#x15F;bu lisans alt&#x131;nda bireysel olarak da&#x11F;&#x131;tabilirsiniz.</p>
<h3 id="7-ba&#x11F;imsiz-&#xE7;ali&#x15F;malarla-bi&#x307;rle&#x15F;ti&#x307;rme">7. <strong>BA&#x11E;IMSIZ &#xC7;ALI&#x15E;MALARLA B&#x130;RLE&#x15E;T&#x130;RME</strong></h3>
<p>Derlemeden do&#x11F;an telif hakk&#x131; derleme sahibinin yasal haklar&#x131;n&#x131; bireysel &#xE7;al&#x131;&#x15F;man&#x131;n izin verdi&#x11F;inin &#xF6;tesinde k&#x131;s&#x131;tlamak i&#xE7;in kullan&#x131;lm&#x131;yorsa, bir belgenin ya da t&#xFC;revlerinin depolama birimi ya da da&#x11F;&#x131;t&#x131;m ortam&#x131;nda di&#x11F;er ayr&#x131; ve ba&#x11F;&#x131;ms&#x131;z belge ya da &#xE7;al&#x131;&#x15F;malarla derlemesine &#x201C;birle&#x15F;im&#x201D; ad&#x131; verilir. Belge bir birle&#x15F;ime dahil edildi&#x11F;inde, i&#x15F;bu lisans derlemeye dahil edilen di&#x11F;er i&#x15F;lerden belgenin t&#xFC;revi olmayanlara uygulanmaz.</p>
<p><strong>E&#x11F;er b&#xF6;l&#xFC;m 3&#x2032;&#xFC;n gereklili&#x11F;i olan Kapak Metni belgenin bahsi ge&#xE7;en kopyalar&#x131;na uygulanabilir nitekteyse, ve e&#x11F;er belge birle&#x15F;imin toplam&#x131;n&#x131;n yar&#x131;s&#x131;ndan daha az ise, belgenin kapak metni birle&#x15F;imin i&#xE7;indeki belgeyi kaplayan kapaklarda, ya da belge elektronik bi&#xE7;imdeyse e&#x15F;de&#x11F;er elektronik kapaklarda yer alabilir. Aksi halde birle&#x15F;imin tamam&#x131;n&#x131; &#xE7;evreleyen bas&#x131;l&#x131; kapaklarda bulunmal&#x131;d&#x131;r.</strong></p>
<h3 id="8-&#xE7;evi&#x307;ri&#x307;">8. &#xC7;EV&#x130;R&#x130;</h3>
<p>&#xC7;eviri bir t&#xFC;r de&#x11F;i&#x15F;iklik olarak kabul edilir, bu sebeple belgenin &#xE7;evirisini b&#xF6;l&#xFC;m 4&#x2032;te yer alan ko&#x15F;ullar alt&#x131;nda da&#x11F;&#x131;tabilirsiniz. De&#x11F;i&#x15F;meyen k&#x131;s&#x131;mlar&#x131; &#xE7;evirilerle de&#x11F;i&#x15F;tirirken telif hakk&#x131; sahibinin izni gerekmektedir, ancak De&#x11F;i&#x15F;meyen k&#x131;s&#x131;mlar&#x131;n&#x131;n baz&#x131;lar&#x131;n&#x131;n ya da hepsinin &#xE7;evirilerini &#xF6;zg&#xFC;n s&#xFC;r&#xFC;mleriyle birlikte ekleyebilirsiniz. &#x130;&#x15F;bu lisans&#x131;n &#x130;ngilizce s&#xFC;r&#xFC;m&#xFC; ile uyar&#x131;lar&#x131;n ve vazge&#xE7;enlerin &#xF6;zg&#xFC;n s&#xFC;r&#xFC;mlerini de dahil etmeniz ko&#x15F;uluyla lisans&#x131;n bir &#xE7;evirisini, belgedeki t&#xFC;m lisans uyar&#x131;lar&#x131;n&#x131; ve Haklar&#x131;ndan Vazge&#xE7;enler&#x2019;i ekleyebilirsiniz. &#x130;&#x15F;bu lisans&#x131;n &#xF6;zg&#xFC;n metniyle &#xE7;evirisi aras&#x131;nda, ya da bir uyar&#x131; veya vazge&#xE7;en aras&#x131;nda bir uyumsuzluk olmas&#x131; durumunda, &#xF6;zg&#xFC;n &#x130;ngilizce metin ge&#xE7;erli olacakt&#x131;r.</p>
<p>E&#x11F;er bir k&#x131;sm&#x131;n ad&#x131; &#x201C;Referanslar&#x201D;, &#x201C;&#x130;thaflar&#x201D; ya da &#x201C;Ge&#xE7;mi&#x15F;&#x201D; ise, Ba&#x15F;l&#x131;&#x11F;&#x131;n&#x131; Koruma (b&#xF6;l&#xFC;m 1) gereklili&#x11F;i (b&#xF6;l&#xFC;m 4) genellikle halihaz&#x131;rdaki ba&#x15F;l&#x131;&#x11F;&#x131; de&#x11F;i&#x15F;tirmeyi gerektirir.</p>
<h3 id="9-li&#x307;sans-i&#x307;ptali&#x307;">9. L&#x130;SANS &#x130;PTAL&#x130;</h3>
<p>&#x130;&#x15F;bu lisans alt&#x131;nda a&#xE7;&#x131;k&#xE7;a izin verildi&#x11F;i durumlar d&#x131;&#x15F;&#x131;nda belgeyi kopyalayamaz, de&#x11F;i&#x15F;tiremez, da&#x11F;&#x131;tamaz, belgeye alt lisans ba&#x11F;layamazs&#x131;n&#x131;z. Belgeyi kopyalama, de&#x11F;i&#x15F;tirme, alt lisanslama ya da da&#x11F;&#x131;tma giri&#x15F;imi h&#xFC;k&#xFC;ms&#xFC;z olup, i&#x15F;bu lisans alt&#x131;ndaki her t&#xFC;rl&#xFC; hakk&#x131;n&#x131;z&#x131; kendili&#x11F;inden sonland&#x131;r&#x131;r. Ancak, i&#x15F;bu lisans alt&#x131;nda sizden kopyalar&#x131; alan, ya da haklar&#x131; edinen taraflar&#x131;n, bu t&#xFC;r taraflar uygunlu&#x11F;unu korudu&#x11F;u s&#xFC;rece, lisanslar&#x131; sonland&#x131;r&#x131;lmaz.</p>
<p>Bununla birlikte, i&#x15F;bu lisans&#x131;n ihlalini durdurursan&#x131;z; belli bir telif hakk&#x131; sahibi taraf&#x131;ndan verilen lisans&#x131;n&#x131;z (a) telif hakk&#x131; sahibi, a&#xE7;&#x131;k&#xE7;a ve tamamen lisans&#x131;n&#x131;z&#x131; sonland&#x131;rmad&#x131;ysa ge&#xE7;ici olarak, ya da (b) telif hakk&#x131; sahibi, durdurmadan itibaren 60 g&#xFC;n i&#xE7;inde uygun yollardan ihlali bildirmediyse kal&#x131;c&#x131; olarak yeniden sa&#x11F;lan&#x131;r.</p>
<p>Buna ek olarak, e&#x11F;er telif hakk&#x131; sahibi uygun yollardan size ihlali bildirirse bellli bir telif sahibinden gelen lisans&#x131;n&#x131;z kal&#x131;c&#x131; olarak yeniden sa&#x11F;lan&#x131;r; i&#x15F;bu lisans&#x131;n (herhangi bir i&#x15F; i&#xE7;in) ihlalinden dolay&#x131; bahsi ge&#xE7;en telif sahibi taraf&#x131;ndan ald&#x131;&#x11F;&#x131;n&#x131;z bu ilk uyar&#x131; olup, uyar&#x131; alman&#x131;zdan itibaren 30 g&#xFC;n i&#xE7;inde ihlali giderirsiniz.</p>
<p>Bu b&#xF6;l&#xFC;m uyar&#x131;nca haklar&#x131;n&#x131;z&#x131;n iptali i&#x15F;bu lisans alt&#x131;nda kopyalar&#x131; ya da haklar&#x131; alan taraflar&#x131;n lisanslar&#x131;n&#x131; sonland&#x131;rmaz. E&#x11F;er haklar&#x131;n&#x131;z sonland&#x131;r&#x131;l&#x131;rsa ve kal&#x131;c&#x131; olarak tekrar size verilmezse, ayn&#x131; materyalin baz&#x131; ya da t&#xFC;m kopyalar&#x131;n&#x131; elde etmek size kullan&#x131;m hakk&#x131; vermez.</p>
<h3 id="10-i&#x307;&#x15F;bu-li&#x307;sansin-i&#x307;leri&#x307;de-de&#x11F;i&#x307;&#x15F;ti&#x307;ri&#x307;lmesi&#x307;">10. <strong>&#x130;&#x15E;BU L&#x130;SANSIN &#x130;LER&#x130;DE DE&#x11E;&#x130;&#x15E;T&#x130;R&#x130;LMES&#x130;</strong></h3>
<p>&#xD6;zg&#xFC;r Yaz&#x131;l&#x131;m Vakf&#x131;, d&#xF6;nem d&#xF6;nem GNU &#xD6;zg&#xFC;r Belgelendirme Lisans&#x131;&#x2019;n&#x131;n yeni, d&#xFC;zenlenmi&#x15F; bir s&#xFC;r&#xFC;m&#xFC;n&#xFC; yay&#x131;mlayabilir. Bu yeni s&#xFC;r&#xFC;mler &#x15F;imdiki s&#xFC;r&#xFC;mlerle ayn&#x131; ruhu ta&#x15F;&#x131;yor olup, yeni sorun ve endi&#x15F;eleri ele al&#x131;&#x15F;&#x131; bak&#x131;m&#x131;ndan farkl&#x131;l&#x131;k g&#xF6;sterebilir. Bak&#x131;n&#x131;z <a href="http://www.gnu.org/licences/" target="_blank">http://www.gnu.org/licences/</a>.</p>
<p>&#x130;&#x15F;bu lisans&#x131;n her bir s&#xFC;r&#xFC;m&#xFC;ne ay&#x131;rt edici bir s&#xFC;r&#xFC;m numaras&#x131; verilir. E&#x11F;er belge GNU &#xD6;zg&#xFC;r Belgelendirme Lisans&#x131;&#x2019;n&#x131;n baz&#x131; numaral&#x131; s&#xFC;r&#xFC;mlerinin ya da &#x201C;daha sonraki herhangi bir s&#xFC;r&#xFC;m&#xFC;n&#x201D; ona uyguland&#x131;&#x11F;&#x131;n&#x131; belirtiyorsa, bahsi ge&#xE7;en numaral&#x131; s&#xFC;r&#xFC;m&#xFC;n ya da &#xD6;zg&#xFC;r Yaz&#x131;l&#x131;m Vakf&#x131; taraf&#x131;ndan yay&#x131;mlanan daha sonraki bir (taslak olmayan) s&#xFC;r&#xFC;m&#xFC;n h&#xFC;k&#xFC;mlerini ve ko&#x15F;ullar&#x131;n&#x131; kabul etme se&#xE7;ene&#x11F;iniz mevcuttur. E&#x11F;er belge bir s&#xFC;r&#xFC;m numaras&#x131; belirtmiyorsa, &#xD6;zg&#xFC;r Yaz&#x131;l&#x131;m Vakf&#x131; taraf&#x131;ndan yay&#x131;mlanan (taslak olmayan) s&#xFC;r&#xFC;mlerden herhangi birini se&#xE7;ebilirsiniz. E&#x11F;er belgede bir vekilin i&#x15F;bu lisans&#x131;n hangi gelecek s&#xFC;r&#xFC;m&#xFC;n&#xFC;n kullan&#x131;laca&#x11F;&#x131;na karar verebilece&#x11F;i belirtiliyorsa, bahsi ge&#xE7;en vekilin bir s&#xFC;r&#xFC;m&#xFC; kabul etti&#x11F;ini kamuya beyan etmesi size kal&#x131;c&#x131; olarak belgenin o s&#xFC;r&#xFC;m&#xFC;n&#xFC; se&#xE7;me yetkisi verir.</p>
<h3 id="11-yeni&#x307;den-li&#x307;sanslama">11. <strong>YEN&#x130;DEN L&#x130;SANSLAMA</strong></h3>
<p><strong>&quot;Massive Multiauthor Collaboration Site&quot;</strong> (ya da &quot;MMC Site&quot;) (tr. &#x201C;Kitlesel &#xC7;ok Yazarl&#x131; &#x130;&#x15F;birli&#x11F;i Siteleri&#x201D;) , telif hakk&#x131; al&#x131;nabilir i&#x15F;leri yay&#x131;mlayan ve bu i&#x15F;leri d&#xFC;zenlemek isteyenlere &#xF6;nemli kolayl&#x131;klar sa&#x11F;layan her t&#xFC;rl&#xFC; D&#xFC;nya &#xC7;ap&#x131;nda A&#x11F; sunucusu anlam&#x131;na gelir. Herkesin d&#xFC;zenlemesine a&#xE7;&#x131;k birden fazla yazar&#x131; olan (wiki ad&#x131; verilen) ortak siteler bu t&#xFC;r sunuculara &#xF6;rnektir. Sitede yer alan bir Kitlesel &#xC7;ok Yazarl&#x131; &#x130;&#x15F;birlik (ya da MMC), MMC sitesinde bu &#x15F;ekilde yay&#x131;mlanan her t&#xFC;rl&#xFC; telif hakk&#x131; al&#x131;nabilir i&#x15F; grubudur.</p>
<p>&#x201C;CC-BY-SA&#x201D;, i&#x15F; merkezi Kaliforniya San Francisco&#x2019;da bulunan, kar amac&#x131; g&#xFC;tmeyen Creative Commons Kurulu&#x15F;u taraf&#x131;ndan yay&#x131;mlanan Creative Commons Attribution- E&#x15F;it Haklar 3.0 lisans&#x131;n&#x131; ve ayn&#x131; kurulu&#x15F; taraf&#x131;ndan i&#x15F;bu lisans&#x131;n telif m&#xFC;sadeli (copyleft) olarak yay&#x131;mlanacak s&#xFC;r&#xFC;mlerini ifade eder.</p>
<p>&#x201C;<strong>Incorporate&#x201D;</strong> bir belgenin tamam&#x131;n&#x131; ya da bir k&#x131;sm&#x131;n&#x131; ba&#x15F;ka bir belgenin par&#xE7;as&#x131; olarak yay&#x131;mlamak ya da yeniden yay&#x131;mlamak anlam&#x131;na gelir.</p>
<p>Bir MMC, e&#x11F;er i&#x15F;bu lisans alt&#x131;nda lisansland&#x131;ysa, ve bu MMC d&#x131;&#x15F;&#x131;ndaki &#xF6;nce i&#x15F;bu lisansla yay&#x131;mlan&#x131;p daha sonra tamamen ya da k&#x131;smen MMC&#x2019;ye ba&#x11F;lanan t&#xFC;m i&#x15F;ler (1) kapak metni ya da <strong>de&#x11F;i&#x15F;meyen</strong> k&#x131;s&#x131;m i&#xE7;ermiyor ve (2) 1 Kas&#x131;m 2008&#x2032;den &#xF6;nce ba&#x11F;land&#x131;ysa, tekrar lisanslamaya uygundur.</p>
<p>Bir MMC sitesinin i&#x15F;leticisi, CC-BY-SA alt&#x131;nda sitede 1 A&#x11F;ustos 2009&#x2032;dan &#xF6;nce yer alan bir MMC&#x2019;yi, yeniden lisanslamaya uygun oldu&#x11F;u takdirde, yeniden yay&#x131;mlayabilir.</p>
<h2 id="ek-bu-lisans&#x131;-belgeleriniz-i&#xE7;in-nas&#x131;l-kullan&#x131;rs&#x131;n&#x131;z"><strong>EK: Bu lisans&#x131; belgeleriniz i&#xE7;in nas&#x131;l kullan&#x131;rs&#x131;n&#x131;z?</strong></h2>
<p>Bu lisans&#x131; yazd&#x131;&#x11F;&#x131;n&#x131;z bir belgede kullanmak i&#xE7;in, belgeye lisans&#x131;n bir kopyas&#x131;n&#x131; ili&#x15F;tirin ve a&#x15F;a&#x11F;&#x131;da yer alan telif hakk&#x131; ve lisans uyar&#x131;lar&#x131;n&#x131; ba&#x15F; sayfan&#x131;n hemen ard&#x131;na ekleyin:</p>
<pre><code class="lang-text">Copyright (C) YIL ADINIZ.

&#x130;&#x15F;bu belgeyi kopyalama, da&#x11F;&#x131;tma ve/veya de&#x11F;i&#x15F;tirme hakk&#x131;, &#xD6;zg&#xFC;r Yaz&#x131;l&#x131;m Vakf&#x131; taraf&#x131;ndan yay&#x131;mlanan GNU &#xD6;zg&#xFC;r Belgelendirme Lisans&#x131; S&#xFC;r&#xFC;m 1.3 ya da daha sonraki s&#xFC;r&#xFC;mler kapsam&#x131;nda verilmi&#x15F; olup; De&#x11F;i&#x15F;meyen K&#x131;s&#x131;mlar, &#xD6;n Kapak Metinleri ve Arka Kapak Metinleri&#x2019;ni i&#xE7;ermez. &#x130;&#x15F;bu lisans&#x131;n bir kopyas&#x131; &#x201C;GNU &#xD6;zg&#xFC;r Belgelendirme Lisans&#x131;&#x201D; b&#xF6;l&#xFC;m&#xFC;nde mevcuttur.
</code></pre>
<p>E&#x11F;er De&#x11F;i&#x15F;meyen K&#x131;s&#x131;mlar, &#xD6;n Kapak Metinleri ve Arka Kapak Metinleri mevcutsa, &#x201C;&#x2026; i&#xE7;ermez&#x201D; ifadesini a&#x15F;a&#x11F;&#x131;daki ifadelerle de&#x11F;i&#x15F;tirin:</p>
<p>&#x2026; De&#x11F;i&#x15F;meyen K&#x131;s&#x131;mlar BA&#x15E;LIKLAR HAL&#x130;NDE L&#x130;STELENM&#x130;&#x15E;, &#xD6;n Kapak Metinleri L&#x130;STELENM&#x130;&#x15E;, Arka Kapak Metinleri de L&#x130;STELENM&#x130;&#x15E; olarak eklenmi&#x15F;tir.</p>
<p>E&#x11F;er Kapak Metinleri olmayan De&#x11F;i&#x15F;meyen K&#x131;s&#x131;mlar varsa, ya da bahsi ge&#xE7;en &#xFC;&#xE7; k&#x131;sm&#x131;n b&#xF6;yle bir durumu s&#xF6;z konusuysa, durumu uygun hale getirmek i&#xE7;in di&#x11F;er iki se&#xE7;enekle birle&#x15F;tiriniz.</p>
<p>E&#x11F;er belgeniz anla&#x15F;&#x131;lmas&#x131; zor program kodu &#xF6;rnekleri i&#xE7;eriyorsa, &#xF6;zg&#xFC;r yaz&#x131;l&#x131;mda kullan&#x131;lmalar&#x131;na izin verebilmek ad&#x131;na ayn&#x131; do&#x11F;rultudaki &#xF6;rnekleri kendi se&#xE7;ece&#x11F;iniz bir &#xF6;zg&#xFC;r yaz&#x131;l&#x131;m lisans&#x131;yla, &#xF6;rne&#x11F;in GNU Genel Kamu Lisans&#x131;&#x2019;yla &#xE7;&#x131;karman&#x131;z&#x131; &#xF6;neririz.</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="kaynakca.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: Kaynakça">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"description":"Lisans metninin Türkçesidir. Aslında çeviridir. Lisansın İngilizce versiyonunun açıklaması niteliğindedir. Lisansın doğru anlaşılması için asıl metni okunması önemle rica olunur.","title":"GNU Özgür Belgelendirme Lisansı","level":"8.3","depth":1,"previous":{"title":"Kaynakça","level":"8.2","depth":1,"path":"son-kisim/kaynakca.md","ref":"son-kisim/kaynakca.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"son-kisim/lisans.md","mtime":"2022-08-19T06:21:31.981Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2022-08-19T06:22:03.966Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

